Hameem1/PIC18-based-Voltmeter/main.c
/*
 * File:   main.c
 * Author: Hameem
 *
 * Created on June 13, 2016, 6:07 AM
 */


// PIC18F4550 Configuration Bit Settings

// 'C' source line config statements

#include <xc.h>

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

// CONFIG1L
#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config USBDIV = 1       // USB Clock Selection bit (used in Full-Speed USB mode only; UCFG:FSEN = 1) (USB clock source comes directly from the primary oscillator block with no postscale)

// CONFIG1H
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator (HS))
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor disabled)
#pragma config IESO = OFF       // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = OFF       // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOR = ON         // Brown-out Reset Enable bits (Brown-out Reset enabled in hardware only (SBOREN is disabled))
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config VREGEN = OFF     // USB Voltage Regulator Enable bit (USB voltage regulator disabled)

// CONFIG2H
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)

// CONFIG3H
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)

// CONFIG4L
#pragma config STVREN = ON      // Stack Full/Underflow Reset Enable bit (Stack full/underflow will cause Reset)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)
#pragma config ICPRT = OFF      // Dedicated In-Circuit Debug/Programming Port (ICPORT) Enable bit (ICPORT disabled)
#pragma config XINST = OFF      // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF        // Code Protection bit (Block 0 (000800-001FFFh) is not code-protected)
#pragma config CP1 = OFF        // Code Protection bit (Block 1 (002000-003FFFh) is not code-protected)
#pragma config CP2 = OFF        // Code Protection bit (Block 2 (004000-005FFFh) is not code-protected)
#pragma config CP3 = OFF        // Code Protection bit (Block 3 (006000-007FFFh) is not code-protected)

// CONFIG5H
#pragma config CPB = OFF        // Boot Block Code Protection bit (Boot block (000000-0007FFh) is not code-protected)
#pragma config CPD = OFF        // Data EEPROM Code Protection bit (Data EEPROM is not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection bit (Block 0 (000800-001FFFh) is not write-protected)
#pragma config WRT1 = OFF       // Write Protection bit (Block 1 (002000-003FFFh) is not write-protected)
#pragma config WRT2 = OFF       // Write Protection bit (Block 2 (004000-005FFFh) is not write-protected)
#pragma config WRT3 = OFF       // Write Protection bit (Block 3 (006000-007FFFh) is not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) are not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot block (000000-0007FFh) is not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM is not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection bit (Block 0 (000800-001FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection bit (Block 1 (002000-003FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection bit (Block 2 (004000-005FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection bit (Block 3 (006000-007FFFh) is not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot block (000000-0007FFh) is not protected from table reads executed in other blocks)



#include <p18F4550.h>
#define _XTAL_FREQ 20000000

#define OUT PORTB
#define S1 PORTDbits.RD7
#define S2 PORTDbits.RD6
#define S3 PORTDbits.RD5

void adc_init(void);
void init_timer(void);
void interrupt_enable(void);
void fragment (unsigned int x);
void delay_10ms(int t);                  //delay in multiples of 10ms

unsigned char table[10] = {0x03,0x9F,0x25,0x0D,0x99,0x49,0x41,0x1F,0x01,0x19};
unsigned char number[3];
unsigned char count = 0;
unsigned int input = 0;
float factor = 0.32;


void interrupt isr()
{
    if(INTCONbits.TMR0IF==1)
    {    
        if (count==0)
        {
            S1 = 0; S2 = 1; S3 = 1;
            OUT = number[2];
            count++;
        }
        
        else if (count==1)
        {
            S1 = 1; S2 = 0; S3 = 1;
            OUT = number[1]-1;
            count++;
        }
        
        else
        {
            S1 = 1; S2 = 1; S3 = 0;
            OUT = number[0];
            count=0;
        }
               

        TMR0H=0xB1;
        TMR0L=0xE0;
        INTCONbits.TMR0IF=0;
    }
    
    if (PIR1bits.ADIF == 1)
    {
        unsigned int x;
        x = (ADRESH & 0x0003)<<8;
        x |= (ADRESL) ;
        input = x*factor;
        PIR1bits.ADIF = 0;
    }
    
}


void main(void) 
{
    
    TRISAbits.RA0 = 1;
    TRISB = 0;
    TRISD = 0x1F;
    
    interrupt_enable();
    adc_init();
    init_timer();
    
    while(1)
    {
        delay_10ms(10);
        fragment(input);
        ADCON0bits.GO_DONE = 1;
    }
    
}


void fragment (unsigned int x)
{
    unsigned char unit,ten,hun;

    unit = (x/1)%10;
    ten  = (x/10)%10;
    hun  = (x/100)%10;    
    
    number[0] = table[unit];
    number[1] = table[ten];
    number[2] = table[hun];
    
}


void init_timer(void)       //4ms timer
{
    T0CON=0b00001000;
    TMR0H=0xB1;
    TMR0L=0xE0;
    
    INTCONbits.TMR0IF=0;
    T0CONbits.TMR0ON=1;
}

void interrupt_enable(void)
{
    INTCONbits.GIE=1;
    INTCONbits.PEIE=1;
    INTCONbits.TMR0IE = 1;
    PIE1bits.ADIE = 1;
}

void adc_init()
{
    ADCON1 = 0b00001110;
    ADCON0 = 0b00000000;
    ADCON2 = 0b10100101;
    PIR1bits.ADIF = 0;
    ADCON0bits.ADON = 1;
    __delay_us (5);
}

void delay_10ms(int t)
{
    for(int i=0; i<t;i++)
    {
        __delay_ms(10);
    }
}